In [1]:
import pandas as pd

In [4]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [5]:
s1=pd.Series([10,20,30])
s1 [0:2]

0    10
1    20
dtype: int64

In [6]:
col_idx=['A','B','C']
data = [10,20,30]
pd.Series(data,index=col_idx)

A    10
B    20
C    30
dtype: int64

In [9]:
dict_data={'A':10, 'B':20, 'C':30}
type(dict_data)
s3=pd.Series(dict_data)

In [10]:
s3

A    10
B    20
C    30
dtype: int64

In [11]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data)
print(s1)

# 인덱스 지정하여 시리즈 생성
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)
print(s2)

# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
d    4
dtype: int64

In [13]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [14]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
class Account:
    def __init__(self, owner, balance):
        self.owner = owner      # 인스턴스 변수
        self.balance = balance  # 인스턴스 변수

In [16]:
acc1 = Account("홍길동", 1000)
acc2 = Account("김철수", 5000)

In [17]:
Account

__main__.Account

In [4]:
population = pd.Series([9776.0, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '인천']])  # 서울과 부산의 데이터만 선택

9776.0
서울    9776.0
인천    1566.0
dtype: float64

In [7]:
population [['서울','인천']]

서울    9776.0
인천    1566.0
dtype: float64

In [8]:
population['제주']=20

In [9]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      20.0
dtype: float64

In [10]:
population['제주']=50

In [11]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      50.0
dtype: float64

In [ ]:
#데이터프레임

In [12]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [15]:
pd.DataFrame(data, columns=['A','B','C'], index=['쿠키','스낵','케익'])

    A  B  C
쿠키  1  2  3
스낵  4  5  6
케익  7  8  9

In [16]:
import numpy as np
import pandas as pd

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [17]:
pd.DataFrame(arr, columns=['A','B','C'], index=['쿠키','스낵','케익'])

    A  B  C
쿠키  1  2  3
스낵  4  5  6
케익  7  8  9

In [18]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])
names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [20]:
#pd.DataFrame([names, ages, scores])
pd.DataFrame({
  '이름':names,
  '나이':ages,
  '점수':scores
})

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [21]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = pd.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78